<template><h2 id="正則表達式" tabindex="-1"><a class="header-anchor" href="#正則表達式" aria-hidden="true">#</a> 正則表達式</h2>
<div class="custom-container tip"><svg viewBox="0 0 25 25" xmlns="http://www.w3.org/2000/svg" xml:space="preserve" style="fill-rule:evenodd;clip-rule:evenodd;stroke-linejoin:round;stroke-miterlimit:2"><path d="M297.6 258.73H296c-59.47.87-110.69 51.45-111.83 110.43-.626 36.485 16.525 71.085 45.94 92.68 17.86 13.18 29.88 33.56 33.77 56.42h67.62c4-22.82 16.13-43.3 34.16-56.74 28.589-21.097 45.496-54.587 45.496-90.118 0-30.03-12.078-58.833-33.496-79.882a113.133 113.133 0 0 0-80.06-32.79ZM265.19 550.7v26.6c0 4.84 1.17 6.43 1.17 6.43l63.72-.59V550.7h-64.89Z" style="fill:#48b884;fill-rule:nonzero" transform="matrix(.042 0 0 .042 0 -5.178)"/><path d="M297.64 123.3C133.26 123.3 0 256.56 0 420.94s133.26 297.63 297.64 297.63 297.63-133.25 297.63-297.63S462 123.3 297.64 123.3ZM385 487.57c-14.11 10.48-22.51 28.09-22.51 47.14v48.43c-.016 17.792-14.648 32.428-32.44 32.45h-64.86c-15.6 0-32.44-12-32.44-38.29v-42.82c0-19-8.21-36.4-21.93-46.52-37.882-27.85-59.959-72.44-59.14-119.45 1.46-77.24 66-141.09 143.81-142.22 38.87.19 76.89 14.37 105 42.11a143.764 143.764 0 0 1 43.14 103c-.159 45.761-21.911 88.86-58.63 116.17Z" style="fill:#48b884;fill-rule:nonzero" transform="matrix(.042 0 0 .042 0 -5.178)"/></svg><p class="custom-container-title">TIP</p>
<p>正則表達式是一種描述字符串結果的語法規則，是一個特定的格式化模式，可以匹配、替換、截取匹配的字符串。常用的語言基本上都有正則表達式，如JavaScript、java等。其實，只有了解一種語言的正則使用，其他語言的正則使用起來，就相對簡單些。文本主要圍繞解決下面問題展開。</p>
</div>
<h3 id="正規表達語法" tabindex="-1"><a class="header-anchor" href="#正規表達語法" aria-hidden="true">#</a> 正規表達語法</h3>
<p>定界符號：多種都可以%%、||、常用//</p>
<p>原子：最少的一個匹配單位位（放在定界符中）、在一個正則表達式中、至少有一個原子</p>
<p>原子是正則表達式的最基本的組成單元、而且在每個模式中最少要包含一個原子、原子是由所有那些未指定為元字符的打印和非打印字符組成、具體分為5類。</p>
<ol>
<li>
<p>普通字符作為原子：如、a-z A-Z 0-9等</p>
</li>
<li>
<p>一些特殊字符和轉義後元字符作為原子：所有標點符號、但語句特殊意義的符號要轉義後才可作為原子、如：\” \’  \*  \+ \? \. 等</p>
</li>
<li>
<p>一些非打印字符作為原子、如：\f \n \r \t \v \cx</p>
<ul>
<li>
<p>\f 換頁符</p>
</li>
<li>
<p>\n 換行符</p>
</li>
<li>
<p>\r 回車符</p>
</li>
<li>
<p>\t 制表符</p>
</li>
<li>
<p>\v 垂直制表符</p>
</li>
<li>
<p>\cx 匹配由x指明的控制字符</p>
</li>
</ul>
</li>
<li>
<p>使用”通用字符類型”作為原子、如：\d\D\w\W\s\S</p>
<ul>
<li>
<p>\d 代表任意一個數字 [0-9]</p>
</li>
<li>
<p>\D 代表任意一個非數字 [^0-9]</p>
</li>
<li>
<p>\w 代表任意一個字 a-z A-Z 0-9 _ [a-zA-Z_]</p>
</li>
<li>
<p>\W 代表任意一個非字 除了a-z A-Z 0-9 <em>之外的所有字符[^a-zA-Z</em>]</p>
</li>
<li>
<p>\s 代表空白 [\t\n\f\v]</p>
</li>
<li>
<p>\S 代表非空白 [^\t\n\f\v]</p>
</li>
</ul>
</li>
<li>
<p>自定義原子表([])作為原子、如：’/[apj]sp/’</p>
<ul>
<li>[a-zA-Z] -從哪到哪區間範圍 ^除列表中</li>
</ul>
</li>
</ol>
<p>元字符：不能在正則表達式中單獨使用、修飾原子、是用來擴展原子功能和限定功能（寫在定界符中）</p>
<ul>
<li>
<p>* 用來修飾其前面的原子可以出現0個1個或多個（任意次） ｛0，｝</p>
</li>
<li>
<p>+ 用來修飾其前面的原子可以出現1次或多次、不能沒有至少一次｛1，｝</p>
</li>
<li>
<p>? 用來修飾其前面的原子可以出現0次或1次 ｛0，1｝</p>
</li>
<li>
<p>. 匹配任意單個字符</p>
</li>
<li>
<p>{m} 用來修飾其前面原子只能出現m次</p>
</li>
<li>
<p>{n,m} 用來修飾其前面原子只能出現n到m次</p>
</li>
<li>
<p>{n,} 用來修飾其前面原子最少出現n次</p>
</li>
<li>
<p>^或\A 匹配輸入字符串開始位置</p>
</li>
<li>
<p>$或\Z 匹配輸入字符串結束位置</p>
</li>
<li>
<p>\b 匹配單詞的邊界</p>
</li>
<li>
<p>\B 匹配除單詞邊界以外的部分</p>
</li>
<li>
<p>() 匹配其整體為一個原子、即模式單元、可以理解為多個單元組成的大單元。</p>
</li>
</ul>
<p>改變優先級別</p>
<p>將小原子就成大原子</p>
<p>子模式、整個表達式是一個大的模式、小括號中是每個獨立的子模式反向引用</p>
<p>模式修正符號：修正、對模式（正則）修正（寫在定界符號外面、寫在右邊）</p>
<ul>
<li>
<p>符號：i : 忽略大小寫</p>
</li>
<li>
<p>m: 視為多行、在使用^和$這二個符號時、每一行滿足都可以（默認視為一行處理）</p>
</li>
<li>
<p>s:修正正則表達式中的 . 可以匹配換行符號、（默認. 不能匹配回車符號）</p>
</li>
<li>
<p>x:修正正則表達式、可以省略空白</p>
</li>
<li>
<p>U:取消貪婪模式 等價於(.*?)</p>
</li>
</ul>
<h2 id="參考" tabindex="-1"><a class="header-anchor" href="#參考" aria-hidden="true">#</a> 參考</h2>
<h6 id="程式人生-php正則表達式-阿新" tabindex="-1"><a class="header-anchor" href="#程式人生-php正則表達式-阿新" aria-hidden="true">#</a> <a href="https://www.796t.com/content/1505796055.html" target="_blank" rel="noopener noreferrer">程式人生/PHP正則表達式/阿新</a></h6>
</template>
