<template><h2 id="正則表達式" tabindex="-1"><a class="header-anchor" href="#正則表達式" aria-hidden="true">#</a> 正則表達式</h2>
<div class="custom-container info"><svg viewBox="0 0 25 25" xmlns="http://www.w3.org/2000/svg" xml:space="preserve" style="fill-rule:evenodd;clip-rule:evenodd;stroke-linejoin:round;stroke-miterlimit:2"><path d="M13 1.188C6.477 1.188 1.188 6.477 1.188 13S6.477 24.813 13 24.813 24.813 19.523 24.813 13c0-6.523-5.29-11.812-11.813-11.812Zm2.459 18.307c-.608.24-1.092.422-1.455.548a3.838 3.838 0 0 1-1.262.189c-.736 0-1.309-.18-1.717-.539a1.74 1.74 0 0 1-.611-1.367c0-.215.015-.435.045-.659a8.23 8.23 0 0 1 .147-.759l.761-2.688c.067-.258.125-.503.171-.731.046-.23.068-.441.068-.633 0-.342-.071-.582-.212-.717-.143-.135-.412-.201-.813-.201-.196 0-.398.029-.605.09-.205.063-.383.12-.529.176l.201-.828c.498-.203.975-.377 1.43-.521a4.225 4.225 0 0 1 1.29-.218c.731 0 1.295.178 1.692.53.395.353.594.812.594 1.376 0 .117-.014.323-.041.617a4.129 4.129 0 0 1-.152.811l-.757 2.68a7.582 7.582 0 0 0-.167.736 3.892 3.892 0 0 0-.073.626c0 .356.079.599.239.728.158.129.435.194.827.194.185 0 .392-.033.626-.097.232-.064.4-.121.506-.17l-.203.827Zm-.134-10.878a1.807 1.807 0 0 1-1.275.492c-.496 0-.924-.164-1.28-.492a1.57 1.57 0 0 1-.533-1.193c0-.465.18-.865.533-1.196a1.812 1.812 0 0 1 1.28-.497c.497 0 .923.165 1.275.497.353.331.53.731.53 1.196 0 .467-.177.865-.53 1.193Z" style="fill:#157ffb;fill-rule:nonzero" transform="translate(-1.257 -1.257) scale(1.0582)"/></svg><p class="custom-container-title">INFO</p>
<p>正則表達式是一種描述字符串結果的語法規則，是一個特定的格式化模式，可以匹配、替換、截取匹配的字符串。常用的語言基本上都有正則表達式，如JavaScript、java等。其實，只有了解一種語言的正則使用，其他語言的正則使用起來，就相對簡單些。文本主要圍繞解決下面問題展開。</p>
</div>
<h3 id="正規表達語法" tabindex="-1"><a class="header-anchor" href="#正規表達語法" aria-hidden="true">#</a> 正規表達語法</h3>
<p>定界符號：多種都可以%%、||、常用//</p>
<p>原子：最少的一個匹配單位位（放在定界符中）、在一個正則表達式中、至少有一個原子</p>
<p>原子是正則表達式的最基本的組成單元、而且在每個模式中最少要包含一個原子、原子是由所有那些未指定為元字符的打印和非打印字符組成、具體分為5類。</p>
<ol>
<li>
<p>普通字符作為原子：如、a-z A-Z 0-9等</p>
</li>
<li>
<p>一些特殊字符和轉義後元字符作為原子：所有標點符號、但語句特殊意義的符號要轉義後才可作為原子、如：\” \’  \*  \+ \? \. 等</p>
</li>
<li>
<p>一些非打印字符作為原子、如：\f \n \r \t \v \cx</p>
<ul>
<li>
<p>\f 換頁符</p>
</li>
<li>
<p>\n 換行符</p>
</li>
<li>
<p>\r 回車符</p>
</li>
<li>
<p>\t 制表符</p>
</li>
<li>
<p>\v 垂直制表符</p>
</li>
<li>
<p>\cx 匹配由x指明的控制字符</p>
</li>
</ul>
</li>
<li>
<p>使用”通用字符類型”作為原子、如：\d\D\w\W\s\S</p>
<ul>
<li>
<p>\d 代表任意一個數字 [0-9]</p>
</li>
<li>
<p>\D 代表任意一個非數字 [^0-9]</p>
</li>
<li>
<p>\w 代表任意一個字 a-z A-Z 0-9 _ [a-zA-Z_]</p>
</li>
<li>
<p>\W 代表任意一個非字 除了a-z A-Z 0-9 <em>之外的所有字符[^a-zA-Z</em>]</p>
</li>
<li>
<p>\s 代表空白 [\t\n\f\v]</p>
</li>
<li>
<p>\S 代表非空白 [^\t\n\f\v]</p>
</li>
</ul>
</li>
<li>
<p>自定義原子表([])作為原子、如：’/[apj]sp/’</p>
<ul>
<li>[a-zA-Z] -從哪到哪區間範圍 ^除列表中</li>
</ul>
</li>
</ol>
<p>元字符：不能在正則表達式中單獨使用、修飾原子、是用來擴展原子功能和限定功能（寫在定界符中）</p>
<ul>
<li>
<p>* 用來修飾其前面的原子可以出現0個1個或多個（任意次） ｛0，｝</p>
</li>
<li>
<p>+ 用來修飾其前面的原子可以出現1次或多次、不能沒有至少一次｛1，｝</p>
</li>
<li>
<p>? 用來修飾其前面的原子可以出現0次或1次 ｛0，1｝</p>
</li>
<li>
<p>. 匹配任意單個字符</p>
</li>
<li>
<p>{m} 用來修飾其前面原子只能出現m次</p>
</li>
<li>
<p>{n,m} 用來修飾其前面原子只能出現n到m次</p>
</li>
<li>
<p>{n,} 用來修飾其前面原子最少出現n次</p>
</li>
<li>
<p>^或\A 匹配輸入字符串開始位置</p>
</li>
<li>
<p>$或\Z 匹配輸入字符串結束位置</p>
</li>
<li>
<p>\b 匹配單詞的邊界</p>
</li>
<li>
<p>\B 匹配除單詞邊界以外的部分</p>
</li>
<li>
<p>() 匹配其整體為一個原子、即模式單元、可以理解為多個單元組成的大單元。</p>
</li>
</ul>
<p>改變優先級別</p>
<p>將小原子就成大原子</p>
<p>子模式、整個表達式是一個大的模式、小括號中是每個獨立的子模式反向引用</p>
<p>模式修正符號：修正、對模式（正則）修正（寫在定界符號外面、寫在右邊）</p>
<ul>
<li>
<p>符號：i : 忽略大小寫</p>
</li>
<li>
<p>m: 視為多行、在使用^和$這二個符號時、每一行滿足都可以（默認視為一行處理）</p>
</li>
<li>
<p>s:修正正則表達式中的 . 可以匹配換行符號、（默認. 不能匹配回車符號）</p>
</li>
<li>
<p>x:修正正則表達式、可以省略空白</p>
</li>
<li>
<p>U:取消貪婪模式 等價於(.*?)</p>
</li>
</ul>
<h2 id="參考" tabindex="-1"><a class="header-anchor" href="#參考" aria-hidden="true">#</a> 參考</h2>
<h6 id="程式人生-php正則表達式-阿新" tabindex="-1"><a class="header-anchor" href="#程式人生-php正則表達式-阿新" aria-hidden="true">#</a> <a href="https://www.796t.com/content/1505796055.html" target="_blank" rel="noopener noreferrer">程式人生/PHP正則表達式/阿新</a></h6>
</template>
